<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>pfm_app_url</key>
		<string>none</string>
		<key>pfm_description</key>
		<string>Contains per-Client customization for a variety of automatic global scripts to adjust deployed configuration settings</string>
		<key>pfm_documentation_url</key>
		<string>none</string>
		<key>pfm_domain</key>
		<string>com.systima.soeConfig</string>
		<key>pfm_format_version</key>
		<integer>1</integer>
        <key>pfm_icon</key>
		<data>iVBORw0KGgoAAAANSUhEUgAAAEAAAABACAYAAACqaXHeAAAAAXNSR0IArs4c6QAAAARn
QU1BAACxjwv8YQUAAAAJcEhZcwAAFiUAABYlAUlSJPAAAA0+SURBVHhe7ZoJcJRFFsdf
MpNMzslBApEQgWAgBxBBrvIgRESR1RVdLN1V8cBiq8SSUrQ8SnZX19oFa0WxaotlC8qD
wKrFFiIIySJJQJBDERIIIdxHyEXuyTFX8u37z3SS+eY7ZiKZuFXrr+qr6e6Z6X7v9evu
190f/cIv/H8TJD4DDdrxfII90kAST7dHuucJKD0CBALUbeAnJCYmxrRu3bqbMjIyJnA6
NSws7AaDwRAXFBQUgR9KktTR1dXVZLVaq1taWs6Xl5cff/bZZ89y2sZfO/jpws/w2/91
epQOX7Zs2egzZ84839TUtM3hcNSzkv0C/2lubt6GOlAX6hR1B7LTfjIQyshPdHFx8b2N
jY1bnE6nVehy3aAu1Im60YZo63/GEOiVyMLCwl9ZLJbvhMwBA22gLbQp2v7ZQA+Erlix
IgO9080IGQMO2kKbaBsyCFkGFczikceOHXuG3bNByOU3zu4ufuT2cvwE86FtyABZhEyD
giE9PX1IVVXVP/3pdfzgeNM1adXJ76WHir+Uxn25TgrfuEraXnnO/QMGypu3NkpjC5ql
Bw9YpPdOd0qlLU7Xf30BGSALZIJsbhH9p7+uY1iwYEHS+vXrPzGbzbNFmSoNtk5af/Y4
fXzuBJU3N4jSPrbd+RDdN2KMK93FC1zEl41kRxTgQYbZQE+ONNGiUSZKCNUXtbW1dfei
RYue3Lx5cw1nsWz6RX8sZnjqqaeGr127dnN0dPQdokxBs91Gb5V8R4/t+5q+rjxP9dZO
8Y2cR0dn0DhzvCuNBf6vFVZyeq309TaJvqlz0D/O26jFSTQlzkhhBnVDmEym1Hnz5t1W
XV2dz8OinYv8ihv8HTeGnJycxNWrV2+KioqaLsoUfHHxFGVsXU8rThwii8MuStVh7xUp
N3r9a2HLrKzopPT/tNDnldr1QjbICFk561fn+mMA/CaKXetDdvvb3UVyOpwOenL/Dnpk
7zaq6YTxfdPt0UFQPsiPwVhr7aZHD7XRwh/aqR3jRgXICFk5GcWPT/18/QBihXFo+nxC
QsLD7iI5UHhmwWf06bkyUeIfXg7gtyuCDZdslLPHQjVsEDUgK2TmZBg/uqb11a5xw4YN
09LS0paLvIzKDgsr/y860oB5p3/wDC9SbvzxAE+ONDlpJhuhslPdCJAZsnMSUaMmegYI
TkpKip0/f/77vHExibJemuxWuuebzXSmtUmU+EcwazoqKobiTegcN1A+OdzQbyOcaeui
e/ZZqNGuHA6QGbJDB85q6qnXZFhJScnSiRMnrhD5Xrq49+7dvZl2VV0UJfpA6buHj6LH
Rme6PoeGuTaBCqrZpQtqnZR32UZF1xzsJeILH8wZFkI7b4smtQWitLT0tezs7NWctLpL
5GgZIDg3NzclPz//cGho6FBR1sufSw/QH47tEzl97k8ZQ3+ZNJPGxyaIEv841tJFb5zo
pJ01+qtJD29nRdDy9D6v6sFut9fNnTt3WlFR0RXOKsaLlgHCy8rKXs3MzPyjyPdyvPka
Tdm+gYMW/VgjJtREa6bPod/yen895F220xJe1lsd+u4QGhxEP9xppgkxytXv5MmTb2Vl
Za3kpCIoURsbwUOHDjWPGTPmaZHvBSIsPVzoU/mUyGjaN/d31608ePzGUPo2x8xzhP58
befxsrSkQzX6gS7QiZOKStRqNW7cuPEujqxuFPleMOaLai6LnDrDwiNp992P9Nvl9ZjI
vVo400xDTfpGwLyxqxYHSHKgC3TipGJFUKvRxO7yG5GWsbLssEipExIcTJtzHqC06DhR
MnCMjeK6Z0RxG/pLxcrTqnMdjR8/HjopVjNvAwTHx8fHJCYmzhL5Xk61NlKxj95/bfwM
un1ossgNPHckGOnVccqJzpNi9oJTFuUQ5eBoVnJycgwnZTp7G8CwZs2ayUajUdGFn3Oc
7x28eHJjpJlen6C5TRgwXmcDpERoDwUsnZ9XKocBdFq1atVkTspmSe+ajOz+qlp8deWs
SKnzctZUCjfoBl0DQgQv9i+PxfmoNl9Vqy+dQjeZkN4GCImLi5sg0r002qxU2nRN5JRE
GEPoidQskQs8C3llgCG0KOUYQi06FLqFuHNuPA2AGk28pcQRtIyjTbXk7FaPucGspBSK
5XV/sIgNCaJZiTI9ZDh5HBxlI3gjdIOgvdbzNkAoLi3c2T5O+4j3c4cpVsyAMytRf7id
VpkIhW6yQ1TZEOD1MoTBTCnjSrtFpNTJjMVx3OCSZdY/77iiskuEbtBRZF3IPODmm28O
DwoKUpi21Y4bKm2SI3BXMbj4igzVQmfoBh2RdJd4eQBvHVUHslPSHv9gMGZ/b8L09WeZ
1Zdsbx1l1Zw6dUr1BNMQpN+azcfeIBDYpd5OVMWgcbjgraNMs4qKCockSQp/jw7BvKFN
dUebSA0e1RonQT1EG5UG6O7utkNHkXXhaQD4jMNmsymm/OQInC9qU85h8mCjFu56ojZH
2O12CAoD9I4PhQHa29ur3dk+0sz6m5u9tThrGFz21CvDXU/SePPkjdBN0wDA1traek6k
e5kUP8x1rKXFN9WXqN2pL9BA0tEl0e467fYg66RY5cQsdJMNcYUHVFVVHXdn+xgWFkHp
MdprPZbJLy5ViFzgwWanReeEKD3aQMNMyg6rrKw8wR+6HuAoKCg4JNIy7hf3eFq8e+IQ
OXTC5YHCwU28W6F+3dbD/Teoh8m7du06yB8y1/E2E8KrlLa2tm8jIyNHuIvc/NhYS7ds
/1Tk1Fk1NZdezJgicoHh/bM2eqlE+/YJCh2ZHcNDQB4p8viv5L0A7jQxYfXOoN4egC60
XL58ucid7WMyzwPTEhTbBBlvHt1HJ5rrRW7gOdHaRcvLOkROnanxRoXyQOiEmF7mpt4G
wNjo2Lp16xZ3Vs4rWbho0QZ3hPOLtvh9P9gfaqwSzT/QxpOt9tgHr2icFQidYD1ZBWpT
O8w3or6+fuuQIUOy3UVucCI0dccG+rGhVpSokxmbQPmzF7hOhwcCXH/N3WehMvYAPW6J
M9LhXDOvAqJA0NDQUJKQkPAAJyv5kVXi7QEALtK0Z8+eT9zZPrC8fDh1tu6SCE7yMJix
M48KfZwh+kPxNSfNKGr1qTyUXp0doVAeCF0Q4ClmaS1NQnjbOLKmpmZ7bGzsOFHWy9Lv
C+nD8iMipw0MtShtIv0p+1YaHq4fTXqDa7K3yq207oLV9QaJL5beFEYfsAG8aW5uruAN
0H0c4V7irCJ40NpUS11MWlpa66RJk+7jbaTMULlJKVRQdZGqOvX3AJAbw2XN6WN01tLs
2lMkh0eTMVjN8XC5wVFlvZPe4f3K4h876GCjUz5gNcCbI5umRXK98v7EO0SbNm16Y8uW
Ld9zVnXt1PIAgFBq+Pnz59eOHj16rruoDxyS3Jq/kSp9HJZ4E8VGmBCbSEszJtMjo9JF
KdHTRzro31dtZPFxBeZNCsf83/G4H6ES+1+4cCE/NTX195ys4sfpKvRCvSvcYNA1LFmy
5B2r1ao4EcUEV3DXw5QUjjfU/KfNYacD165SmdeLUydbnf1WPiksmAruiFZVHjJDdk6i
Ic0JRM8AkKZz586d5R999NGbvJVUWDCTw+M99zxKqdG4gu8fnq/IAB8XPgpSIw20Jyea
Mjjs9QayQmbIzlm4vqZl9QwAXIHRc88993VxcTHu2BWMNcfTwXsfpznDR4kS/1C+JOW/
BfA+wEF2+7FR6lMYZIXMnFQEPt74MgDAzFk/e/bsvx89ejTPXSQnMSycdvK6/96UXIo0
ah9Xe+J9y+SPB0Qag2jVxAjXyxCJKpsdABkhKycRkmpvGQX+GADgqqVm8uTJb5eWln7m
LpKDI6iXMqdQ2QPP0OOpWZozfQ+KISA+1cDhzhMjTVQ2J4ZeTAtTfRMEQDbIyEm8tOTX
mxX+GgDS4tr1anZ29vL9+/ev5XGmOq5GRpppw+3zqOzXz9ALGbfQEJN6aOp9ZqkWWyWY
gukFXt9P3h1Ln06JpJEad4KQBTJBNs5e5Qeyqsp3vUBMaDQqLy/vdbvdbsFaq4etyynl
X70gLfuhSJq+I08yb1otBX3yrivvyay9Fsm8tUmaXtgiLSvtkPJrHPxf8aUOkAGyQCYh
m4Z/DBxoAEfLNyxevHh+XV1diZDFL7q4t3izJNXx40mzvZu/Exk/QduQAbIImQKuvCcI
lOJCQkLG79ix42+87jYJuQIO2kKbaBsyCFl+FjAo4XbDZ8yYkXPw4MGPWbhWIeeAg7rR
BtpCm6Jtf+exgIIewN43JTMz83bunffYPct5cuqnUytBHagLdaJutCHa+tl6XQuMPwiF
bV8SP5kLFy58sKCg4APeT+zr6OioEzr5BL/Ff/Bf1IG6RJ2oG20M2FgP1KSBEA2CYmLC
HhWCR82cOTNx3rx5o0aMGDEsLi4uJjQ0NJz1Jd6qdrYwlZWVtdzTF/fu3Yu9B7aaeHCK
g6NshOL6hwI/gUDPmqgfDwzSY5SeB2O3Z/wiXMUDJXseKIsH63lA1nQQaAOo0dOmd9s9
SgZM2V9QQPRfcwn1Wo+kSkwAAAAASUVORK5CYII=</data>
		<key>pfm_last_modified</key>
		<date>2025-02-06T14:53:00Z</date>
		<key>pfm_platforms</key>
		<array>
			<string>macOS</string>
		</array>
		<key>pfm_subkeys</key>
		<array>
			<!-- MARK: Boilerplate -->
			<dict>
				<key>pfm_default</key>
				<string>Configuration options for the Automatic Account Setup script</string>
				<key>pfm_description</key>
				<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
				<key>pfm_name</key>
				<string>PayloadDescription</string>
				<key>pfm_title</key>
				<string>Payload Description</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<string>soeSetup</string>
				<key>pfm_description</key>
				<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
				<key>pfm_name</key>
				<string>PayloadDisplayName</string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_title</key>
				<string>Payload Display Name</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<string>com.systima.soeConfig</string>
				<key>pfm_description</key>
				<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the TopLevel value, with an additional appended component. This string must be unique within the profile. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
				<key>pfm_description_reference</key>
				<string>A reverse-DNS-style identifier for the specific payload. It is usually the same identifier as the root-level PayloadIdentifier value with an additional component appended.</string>
				<key>pfm_name</key>
				<string>PayloadIdentifier</string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_title</key>
				<string>Payload Identifier</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<string>com.systima.soeConfig</string>
				<key>pfm_description</key>
				<string>The payload type, which each payload domain's reference page specifies.</string>
				<key>pfm_description_reference</key>
				<string>The payload type.</string>
				<key>pfm_name</key>
				<string>PayloadType</string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_title</key>
				<string>Payload Type</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<string></string>
				<key>pfm_description</key>
				<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
				<key>pfm_description_reference</key>
				<string>A globally unique identifier for the payload. The actual content is unimportant, but it must be globally unique. In macOS, you can use uuidgen to generate reasonable UUIDs.</string>
				<key>pfm_format</key>
				<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
				<key>pfm_name</key>
				<string>PayloadUUID</string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_title</key>
				<string>Payload UUID</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<integer>1</integer>
				<key>pfm_description</key>
				<string>The version of this specific payload.</string>
				<key>pfm_description_reference</key>
				<string>The version number of the individual payload. A profile can consist of payloads with different version numbers. For example, changes to the VPN software in iOS might introduce a new payload version to support additional features, but Mail payload versions would not necessarily change in the same release.</string>
				<key>pfm_name</key>
				<string>PayloadVersion</string>
				<key>pfm_range_list</key>
				<array>
					<integer>1</integer>
				</array>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_title</key>
				<string>Payload Version</string>
				<key>pfm_type</key>
				<string>integer</string>
			</dict>
			<dict>
				<key>pfm_description</key>
				<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
				<key>pfm_name</key>
				<string>PayloadOrganization</string>
				<key>pfm_title</key>
				<string>Payload Organization</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
            <!-- MARK: Client info -->
            <dict>
                <key>pfm_name</key>
                <string>clientNameFull</string>
                <key>pfm_title</key>
                <string>Client Name</string>
                <key>pfm_description</key>
				<string>Full client name, used for almost all script functions, must be spelling and capitalization exact.</string>
                <key>pfm_require</key>
                <string>always</string>
                <key>pfm_type</key>
                <string>string</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>clientNameTag</string>
                <key>pfm_title</key>
                <string>Client Tag</string>
                <key>pfm_description</key>
				<string>2 or 3 letter abbreviation of the client name. Not required if using per-location clientTags in locationTag</string>
                <key>pfm_type</key>
                <string>string</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>huntressOrgKey</string>
                <key>pfm_title</key>
                <string>Huntress Org Key</string>
                <key>pfm_description</key>
                <string>Organization key for Huntress agent deployment</string>
                <key>pfm_type</key>
                <string>string</string>
            </dict>
            <dict>
				<key>pfm_name</key>
				<string>citiesList</string>
				<key>pfm_description</key>
				<string>List of cities in which the client has offices, eg: Melbourne, Sydney etc.

    Location Tag can be a specific city abbreviation eg: MEL / SYD, or a company specific locaiton tag, eg: HM / HS

    For clients with only one Datto enrollment site, include the same common Datto Enrollment URL for all cities.
    For clients with multiple Datto sites, include a the specific Datto Enrollment URL for each city.</string>
				<key>pfm_subkeys</key>
				<array>
					<dict>
						<key>pfm_name</key>
						<string>citiesList</string>
						<key>pfm_subkeys</key>
						<array>
							<dict>
								<key>pfm_name</key>
								<string>cityName</string>
								<key>pfm_require</key>
								<string>always</string>
								<key>pfm_title</key>
								<string>City Name</string>
								<key>pfm_type</key>
								<string>string</string>
								<key>pfm_value_placeholder</key>
								<string>eg: Melbourne</string>
							</dict>
                            <dict>
								<key>pfm_name</key>
								<string>locationTag</string>
								<key>pfm_require</key>
								<string>always</string>
								<key>pfm_title</key>
								<string>Location Tag</string>
								<key>pfm_type</key>
								<string>string</string>
								<key>pfm_value_placeholder</key>
								<string>eg: MEL</string>
							</dict>
                            <dict>
								<key>pfm_name</key>
								<string>dattoEnrollmentURL</string>
                                <key>pfm_require</key>
								<string>always</string>
								<key>pfm_title</key>
								<string>Datto URL</string>
								<key>pfm_type</key>
								<string>string</string>
								<key>pfm_value_placeholder</key>
								<string>https://syrah.centrastage.net/...</string>
							</dict>
						</array>
						<key>pfm_type</key>
						<string>dictionary</string>
					</dict>
				</array>
				<key>pfm_title</key>
				<string>Office Locations</string>
				<key>pfm_type</key>
				<string>array</string>
			</dict>
            <!-- MARK: Device name -->
            <dict>
				<key>pfm_name</key>
				<string>deviceName</string>
				<key>pfm_description</key>
				<string>How the device name should be structured, which components and in what order</string>
                <key>pfm_subkeys</key>
				<array>
                    <dict>
                        <key>pfm_hidden</key>
                        <string>container</string>
                        <key>pfm_subkeys</key>
                        <array>
                            <dict>
                                <key>pfm_name</key>
                                <string>1</string>
                                <key>pfm_default</key>
                                <string>clientTag</string>
                                <key>pfm_title</key>
                                <string>Element 1</string>
                                <key>pfm_description</key>
                                <string>First component of the device name</string>
                                <key>pfm_type</key>
                                <string>string</string>
                                <key>pfm_range_list</key>
                                <array>
                                    <string>clientTag</string>
                                    <string>locationTag</string>
                                    <string>modelTag</string>
                                    <string>macOnly</string>
                                    <string>assetNumber</string>
                                    <string>serialNumber</string>
                                    <string>assignedUser</string>
                                </array>
                                <key>pfm_range_list_titles</key>
                                <array>
                                    <string>Client Tag</string>
                                    <string>Location Tag</string>
                                    <string>Device Model</string>
                                    <string>"MAC"</string>
                                    <string>Asset Number</string>
                                    <string>Serial Number</string>
                                    <string>Assigned User</string>
                                </array>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>2</string>
                                <key>pfm_default</key>
                                <string>locationTag</string>
                                <key>pfm_title</key>
                                <string>Element 2</string>
                                <key>pfm_description</key>
                                <string>Second component of the device name</string>
                                <key>pfm_type</key>
                                <string>string</string>
                                <key>pfm_range_list</key>
                                <array>
                                    <string>clientTag</string>
                                    <string>locationTag</string>
                                    <string>modelTag</string>
                                    <string>macOnly</string>
                                    <string>assetNumber</string>
                                    <string>serialNumber</string>
                                    <string>assignedUser</string>
                                </array>
                                <key>pfm_range_list_titles</key>
                                <array>
                                    <string>Client Tag</string>
                                    <string>Location Tag</string>
                                    <string>Device Model</string>
                                    <string>"MAC"</string>
                                    <string>Asset Number</string>
                                    <string>Serial Number</string>
                                    <string>Assigned User</string>
                                </array>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>3</string>
                                <key>pfm_default</key>
                                <string>modelTag</string>
                                <key>pfm_title</key>
                                <string>Element 3</string>
                                <key>pfm_description</key>
                                <string>Third component of the device name</string>
                                <key>pfm_type</key>
                                <string>string</string>
                                <key>pfm_range_list</key>
                                <array>
                                    <string>clientTag</string>
                                    <string>locationTag</string>
                                    <string>modelTag</string>
                                    <string>macOnly</string>
                                    <string>assetNumber</string>
                                    <string>serialNumber</string>
                                    <string>assignedUser</string>
                                </array>
                                <key>pfm_range_list_titles</key>
                                <array>
                                    <string>Client Tag</string>
                                    <string>Location Tag</string>
                                    <string>Device Model</string>
                                    <string>"MAC"</string>
                                    <string>Asset Number</string>
                                    <string>Serial Number</string>
                                    <string>Assigned User</string>
                                </array>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>4</string>
                                <key>pfm_default</key>
                                <string>assetNumber</string>
                                <key>pfm_title</key>
                                <string>Element 4</string>
                                <key>pfm_description</key>
                                <string>Fourth component of the device name (optional)</string>
                                <key>pfm_type</key>
                                <string>string</string>
                                <key>pfm_range_list</key>
                                <array>
                                    <string>clientTag</string>
                                    <string>locationTag</string>
                                    <string>modelTag</string>
                                    <string>macOnly</string>
                                    <string>assetNumber</string>
                                    <string>serialNumber</string>
                                    <string>assignedUser</string>
                                </array>
                                <key>pfm_range_list_titles</key>
                                <array>
                                    <string>Client Tag</string>
                                    <string>Location Tag</string>
                                    <string>Device Model</string>
                                    <string>"MAC"</string>
                                    <string>Asset Number</string>
                                    <string>Serial Number</string>
                                    <string>Assigned User</string>
                                </array>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>5</string>
                                <key>pfm_title</key>
                                <string>Element 5</string>
                                <key>pfm_description</key>
                                <string>Fifth component of the device name (optional)</string>
                                <key>pfm_type</key>
                                <string>string</string>
                                <key>pfm_range_list</key>
                                <array>
                                    <string>clientTag</string>
                                    <string>locationTag</string>
                                    <string>modelTag</string>
                                    <string>macOnly</string>
                                    <string>assetNumber</string>
                                    <string>serialNumber</string>
                                    <string>assignedUser</string>
                                </array>
                                <key>pfm_range_list_titles</key>
                                <array>
                                    <string>Client Tag</string>
                                    <string>Location Tag</string>
                                    <string>Device Model</string>
                                    <string>"MAC"</string>
                                    <string>Asset Number</string>
                                    <string>Serial Number</string>
                                    <string>Assigned User</string>
                                </array>
                            </dict>
                        </array>
                        <key>pfm_type</key>
                        <string>dictionary</string>
                    </dict>
                </array>
                <key>pfm_title</key>
                <string>Device Name Structure</string>
                <key>pfm_type</key>
                <string>array</string>
			</dict>
			<!-- MARK: Software Array -->
			<dict>
				<key>pfm_description</key>
				<string>All SOE Software required for the client, even if not added to the Dock.
Installomator Labels can be found at:
	https://github.com/Installomator/Installomator/blob/main/Labels.txt
BundleID can be found by running:
    mdls -name kMDItemCFBundleIdentifier -raw "/Applications/App Name.app"</string>
				<key>pfm_documentation_url</key>
				<string>documentation_missing</string>
				<key>pfm_name</key>
				<string>soeSoftware</string>
				<key>pfm_subkeys</key>
				<array>
					<dict>
						<key>pfm_name</key>
						<string>soeSoftware</string>
						<key>pfm_subkeys</key>
						<array>
							<dict>
								<key>pfm_name</key>
								<string>dockIconPosition</string>
								<key>pfm_type</key>
								<string>integer</string>
								<key>pfm_title</key>
								<string>Dock Position</string>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>appName</string>
								<key>pfm_require</key>
								<string>always</string>
								<key>pfm_title</key>
								<string>App Name</string>
								<key>pfm_type</key>
								<string>string</string>
								<key>pfm_value_placeholder</key>
								<string>App Name</string>
							</dict>
                            <dict>
								<key>pfm_name</key>
								<string>VPP</string>
								<key>pfm_type</key>
								<string>boolean</string>
								<key>pfm_title</key>
								<string>VPP</string>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>bundleID</string>
								<key>pfm_title</key>
								<string>bundleID</string>
								<key>pfm_type</key>
								<string>string</string>
								<key>pfm_value_placeholder</key>
								<string>com.developer.app</string>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>itemLabel</string>
								<key>pfm_title</key>
								<string>Installomator label (Optional)</string>
								<key>pfm_type</key>
								<string>string</string>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>addToDock</string>
								<key>pfm_type</key>
								<string>boolean</string>
								<key>pfm_title</key>
								<string>Add to Dock</string>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>soeRequired</string>
								<key>pfm_type</key>
								<string>boolean</string>
								<key>pfm_title</key>
								<string>SOE</string>
							</dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>launchAfterInstall</string>
                                <key>pfm_type</key>
                                <string>boolean</string>
                                <key>pfm_title</key>
                                <string>Launch After Install</string>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>notifyLevel</string>
                                <key>pfm_title</key>
                                <string>Notification Level</string>
                                <key>pfm_description</key>
                                <string>How to notify the user when installation completes</string>
                                <key>pfm_type</key>
                                <string>string</string>
                                <key>pfm_default</key>
                                <string>success</string>
                                <key>pfm_range_list</key>
                                <array>
                                    <string>success</string>
                                    <string>silent</string>
                                </array>
                                <key>pfm_range_list_titles</key>
                                <array>
                                    <string>Success</string>
                                    <string>Silent</string>
                                </array>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>blockingProcessAction</string>
                                <key>pfm_title</key>
                                <string>Blocking Process Action</string>
                                <key>pfm_description</key>
                                <string>How to handle blocking processes during installation</string>
                                <key>pfm_type</key>
                                <string>string</string>
                                <key>pfm_default</key>
                                <string>BLOCKING_PROCESS_ACTION="prompt_user_then_kill" "PROMPT_TIMEOUT=180"</string>
                                <key>pfm_range_list</key>
                                <array>
                                    <string>BLOCKING_PROCESS_ACTION="prompt_user_then_kill" "PROMPT_TIMEOUT=180"</string>
                                    <string>BLOCKING_PROCESS_ACTION=ignore</string>
                                    <string>BLOCKING_PROCESS_ACTION=silent_fail</string>
                                </array>
                                <key>pfm_range_list_titles</key>
                                <array>
                                    <string>Ask User</string>
                                    <string>Ignore</string>
                                    <string>Skip</string>
                                </array>
                            </dict>
                            <dict>
								<key>pfm_name</key>
								<string>installPath</string>
								<key>pfm_title</key>
								<string>Install Path (optional)</string>
								<key>pfm_type</key>
								<string>string</string>
							</dict>
						</array>
						<key>pfm_type</key>
						<string>dictionary</string>
					</dict>
				</array>
				<key>pfm_title</key>
				<string>SOE Software</string>
				<key>pfm_type</key>
				<string>array</string>
			</dict>
            <!-- MARK: Accent color -->
            <dict>
                <key>pfm_default</key>
                <false/>
                <key>pfm_description</key>
                <string>Select the system accent color</string>
                <key>pfm_name</key>
                <string>systemAccentColor</string>
                <key>pfm_range_list</key>
                <array>
                    <integer>4</integer>
                    <integer>5</integer>
                    <integer>6</integer>
                    <integer>0</integer>
                    <integer>1</integer>
                    <integer>2</integer>
                    <integer>3</integer>
                    <integer>-1</integer>
                </array>
                <key>pfm_range_list_titles</key>
                <array>
                    <string>Blue</string>
                    <string>Purple</string>
                    <string>Pink</string>
                    <string>Red</string>
                    <string>Orange</string>
                    <string>Yellow</string>
                    <string>Green</string>
                    <string>Gray</string>
                </array>
                <key>pfm_title</key>
                <string>System Accent Color</string>
                <key>pfm_documentation_url</key>
                <string>https://support.apple.com/en-au/guide/mac-help/mh15217/mac</string>
                <key>pfm_type</key>
                <string>integer</string>
            </dict>
			<!-- MARK: bash -->
			<dict>
				<key>pfm_name</key>
				<string>bashCommands</string>
				<key>pfm_subkeys</key>
				<array>
					<dict>
						<key>pfm_name</key>
						<string>bashCommands</string>
						<key>pfm_subkeys</key>
						<array>
							<dict>
								<key>pfm_name</key>
								<string>plist</string>
								<key>pfm_type</key>
								<string>string</string>
								<key>pfm_title</key>
								<string>plist</string>
								<key>pfm_value_placeholder</key>
								<string>com.apple.finder</string>
								<key>pfm_description</key>
								<string>System domain for the setting to be modified</string>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>commandString</string>
								<key>pfm_type</key>
								<string>string</string>
								<key>pfm_title</key>
								<string>Command</string>
								<key>pfm_description</key>
								<string>The command to be executed.</string>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>commandDescription</string>
								<key>pfm_type</key>
								<string>string</string>
								<key>pfm_title</key>
								<string>Description</string>
								<key>pfm_description</key>
								<string>A description of the command, this will be shown to the User while the Automatic Account Setup script runs</string>
							</dict>
						</array>
						<key>pfm_type</key>
						<string>dictionary</string>
					</dict>
				</array>
				<key>pfm_title</key>
				<string>Bash Commands</string>
				<key>pfm_type</key>
				<string>array</string>
			</dict>
			<!-- MARK: osascript -->
			<dict>
				<key>pfm_name</key>
				<string>applescriptCommands</string>
				<key>pfm_subkeys</key>
				<array>
					<dict>
						<key>pfm_name</key>
						<string>applescriptCommands</string>
						<key>pfm_subkeys</key>
						<array>
                            <dict>
								<key>pfm_name</key>
								<string>osascriptTargetApp</string>
								<key>pfm_type</key>
								<string>string</string>
								<key>pfm_title</key>
								<string>App</string>
								<key>pfm_description</key>
								<string>The App / service to be addressed with the applescsript command</string>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>osascriptCommand</string>
								<key>pfm_type</key>
								<string>string</string>
								<key>pfm_title</key>
								<string>Command</string>
								<key>pfm_description</key>
								<string>The command to be executed.</string>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>osascriptDescription</string>
								<key>pfm_type</key>
								<string>string</string>
								<key>pfm_title</key>
								<string>Description</string>
								<key>pfm_description</key>
								<string>A description of the command, this will be shown to the User while the Automatic Account Setup script runs</string>
							</dict>
						</array>
						<key>pfm_type</key>
						<string>dictionary</string>
					</dict>
				</array>
				<key>pfm_title</key>
				<string>AppleScript Commands</string>
				<key>pfm_type</key>
				<string>array</string>
			</dict>
            <!-- MARK: Other -->
            <dict>
                <key>pfm_name</key>
                <string>disableScreenRecDialog</string>
                <key>pfm_title</key>
                <string>Disable Custom Screen Recording Message</string>
                <key>pfm_description</key>
                <string>Select whether or not the custom ScreenRecording prompt is disabled</string>
                <key>pfm_type</key>
                <string>boolean</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>disableAppUpdateNotifications</string>
                <key>pfm_title</key>
                <string>Disable SOE Software update notifications (not macOS update)</string>
                <key>pfm_description</key>
                <string>When enabled, supresses the dialog notofications advising users of software updates that appear in the notifications feed</string>
                <key>pfm_type</key>
                <string>boolean</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>disableSelfServiceDialog</string>
                <key>pfm_title</key>
                <string>Disable Account Setup Script post setup instructions</string>
                <key>pfm_description</key>
                <string>When enabled, disables the dialog box that appears after running the Account Setup script, instructing users on how to use the Self-Service app</string>
                <key>pfm_type</key>
                <string>boolean</string>
            </dict>
            <!-- MARK: Segmented Control -->
			<dict>
				<key>pfm_name</key>
				<string>PFC_SegmentedControl_0</string>
				<key>pfm_range_list_titles</key>
				<array>
                    <string>Client Info</string>
					<string>Account Setup</string>
                    <string>Software</string>
                    <string>Other</string>
				</array>
				<key>pfm_segments</key>
				<dict>
                    <key>Client Info</key>
                    <array>
                        <string>clientNameFull</string>
                        <string>clientNameTag</string>
                        <string>huntressOrgKey</string>
                        <string>citiesList</string>
                        <string>deviceName</string>
                    </array>
					<key>Account Setup</key>
					<array>
                        <string>systemAccentColor</string>
                        <string>bashCommands</string>
                        <string>applescriptCommands</string>
					</array>
                    <key>Software</key>
                    <array>
                        <string>soeSoftware</string>
                    </array>
                    <key>Other</key>
                    <array>
                        <string>disableScreenRecDialog</string>
                        <string>disableAppUpdateNotifications</string>
                        <string>disableSelfServiceDialog</string>
                    </array>
                    <key>Device Name</key>
                    <array>
                    </array>
				</dict>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
		</array>
		<key>pfm_targets</key>
		<array>
			<string>system</string>
		</array>
		<key>pfm_title</key>
		<string>Systima soeSetup</string>
		<key>pfm_unique</key>
		<true/>
		<key>pfm_version</key>
		<integer>1</integer>
	</dict>
</plist>
